documents/EUDR API – CF2 Submit DDS Test/EUDR - API EO CF2 v1.0 - ANNEX - Import_with_geolocations_by_auth_representative_request_example.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://ec.europa.eu/tracesnt/certificate/eudr/submission/v1" xmlns:v11="http://ec.europa.eu/tracesnt/certificate/eudr/model/v1" xmlns:v4="http://ec.europa.eu/sanco/tracesnt/base/v4">
    <soapenv:Header>    
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="1">
            <wsu:Timestamp wsu:Id="TS-541F39C6FDB97C7A1B171509172198888">
                <wsu:Created>2024-05-07T14:22:01Z</wsu:Created>
                <wsu:Expires>2024-05-07T14:30:21Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken wsu:Id="UsernameToken-541F39C6FDB97C7A1B171509172198787">
                <wsse:Username>username</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest"/>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">ArTR2Hm4F45stJfvlsHv3A==</wsse:Nonce>
                <wsu:Created>2024-05-07T14:22:01.987Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
        <v4:WebServiceClientId>eudr-repository</v4:WebServiceClientId>
    </soapenv:Header>
    <soapenv:Body>
        <v1:SubmitStatementRequest>
            <v1:operatorType>REPRESENTATIVE_OPERATOR</v1:operatorType>
            <v1:statement>
				<v11:internalReferenceNumber>FR-000003</v11:internalReferenceNumber>
				<v11:activityType>IMPORT</v11:activityType>
				<v11:operator>
					<v11:referenceNumber>
						<v11:identifierType>eori</v11:identifierType>
						<v11:identifierValue>FR123456789</v11:identifierValue>
					</v11:referenceNumber>
					<v11:nameAndAddress>
						<v4:name>Operator 1</v4:name>
						<v4:country>FR</v4:country>
						<v4:address>48 rue Mozart, 59000 Lille</v4:address>
					</v11:nameAndAddress>
					<v11:email>test@operator.fr</v11:email>
					<v11:phone>0312345678</v11:phone>
				</v11:operator>
				<v11:countryOfActivity>FR</v11:countryOfActivity>
				<v11:borderCrossCountry>FR</v11:borderCrossCountry>                
				<v11:comment>Some comments for the CA</v11:comment>
				<v11:commodities>
					<v11:descriptors>
						<v11:descriptionOfGoods>here is the description of goods</v11:descriptionOfGoods>
						<v11:goodsMeasure>
							<v11:volume>20</v11:volume>
							<v11:netWeight>40</v11:netWeight>
							<v11:supplementaryUnit>10</v11:supplementaryUnit>
							<v11:supplementaryUnitQualifier>MTQ</v11:supplementaryUnitQualifier>
						</v11:goodsMeasure>
					</v11:descriptors>
					<v11:hsHeading>1806</v11:hsHeading>
					<v11:speciesInfo>
						<v11:scientificName>Test</v11:scientificName>
						<v11:commonName>Test</v11:commonName>
					</v11:speciesInfo>				
					<v11:producers>
						<v11:country>FR</v11:country>
						<v11:name>Producer 1</v11:name>
						<v11:geometryGeojson>eyJ0eXBlIjoiRmVhdHVyZUNvbGxlY3Rpb24iLCJmZWF0dXJlcyI6W3sidHlwZSI6IkZlYXR1cmUiLCJwcm9wZXJ0aWVzIjp7IlByb2R1Y3Rpb25QbGFjZSI6IkZhcm0gMSJ9LCJnZW9tZXRyeSI6eyJ0eXBlIjoiUG9seWdvbiIsImNvb3JkaW5hdGVzIjpbW1szLjUzNzU5OCw0NC44NDAyOTFdLFs0Ljg1NTk1Nyw0Ni4zNzcyNTRdLFs1LjQyNzI0Niw0NC45NjQ3OThdLFszLjUzNzU5OCw0NC44NDAyOTFdXV19fV19</v11:geometryGeojson>
					</v11:producers>
				</v11:commodities>
				<v11:geoLocationConfidential>false</v11:geoLocationConfidential>
            </v1:statement>
        </v1:SubmitStatementRequest>    
	</soapenv:Body>
</soapenv:Envelope>